---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePressureDropData.Flow
source: html/3be0c01e-d21a-62de-5e9f-0186fdcfc5fe.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData.Flow Property

The flow of the pipe. Units: (ft³/s).

## Syntax (C#)
```csharp
public double Flow { get; }
```